---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.PanelDoesntMatchCircuitProperties
source: html/7913b0f4-bc2d-cd56-fd7a-9d36e1ff3137.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.PanelDoesntMatchCircuitProperties Property

The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit?

## Syntax (C#)
```csharp
public static FailureDefinitionId PanelDoesntMatchCircuitProperties { get; }
```